# 6th Tutorial: Add/Remove Rows and Columns From DataFrames

In [36]:
people ={
    'first' : ['David' , 'Sam' , 'Justin'],
    'last'  : ['Campbell' , 'Smith' , 'Jozokas'],
    'email' : ['DavidCampbell@gmail.com' , 'SamSmith@gmail.com' , 'JustinJozokas@gmail.com']
}

import pandas as pd

df = pd.DataFrame(people)

df

    first      last                    email
0   David  Campbell  DavidCampbell@gmail.com
1     Sam     Smith       SamSmith@gmail.com
2  Justin   Jozokas  JustinJozokas@gmail.com

In [37]:
df['full_name'] = df['first'] + ' ' + df['last']

In [38]:
df

    first      last                    email       full_name
0   David  Campbell  DavidCampbell@gmail.com  David Campbell
1     Sam     Smith       SamSmith@gmail.com       Sam Smith
2  Justin   Jozokas  JustinJozokas@gmail.com  Justin Jozokas

In [41]:
df.drop(columns=['first' , 'last'] , inplace = True)

In [42]:
df

                     email       full_name
0  DavidCampbell@gmail.com  David Campbell
1       SamSmith@gmail.com       Sam Smith
2  JustinJozokas@gmail.com  Justin Jozokas

In [43]:
df['full_name'].str.split(' ' , expand = True)

        0         1
0   David  Campbell
1     Sam     Smith
2  Justin   Jozokas

In [44]:
df[ ['fisrt' , 'last'] ] = df['full_name'].str.split(' ' , expand = True)

In [45]:
df

                     email       full_name   fisrt      last
0  DavidCampbell@gmail.com  David Campbell   David  Campbell
1       SamSmith@gmail.com       Sam Smith     Sam     Smith
2  JustinJozokas@gmail.com  Justin Jozokas  Justin   Jozokas

In [46]:
df.append({'first':'Tony'} , ignore_index=True)

/var/folders/r6/jy1grym504s3gcqk9gywh6vc0000gn/T/ipykernel_22434/2827264532.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Tony'} , ignore_index=True)

                     email       full_name   fisrt      last first
0  DavidCampbell@gmail.com  David Campbell   David  Campbell   NaN
1       SamSmith@gmail.com       Sam Smith     Sam     Smith   NaN
2  JustinJozokas@gmail.com  Justin Jozokas  Justin   Jozokas   NaN
3                      NaN             NaN     NaN       NaN  Tony

In [47]:
people ={
    'first' : ['Tony' , 'Steve' ],
    'last'  : ['Stark' , 'Rogers' ],
    'email' : ['IronMan@avange.com' , 'Cap@avange.com']
}


df2 = pd.DataFrame(people)

In [48]:
df2

   first    last               email
0   Tony   Stark  IronMan@avange.com
1  Steve  Rogers      Cap@avange.com

In [49]:
df = df.append(df2 , ignore_index = True , sort=False )
df

/var/folders/r6/jy1grym504s3gcqk9gywh6vc0000gn/T/ipykernel_22434/763927978.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2 , ignore_index = True , sort=False )

                     email       full_name   fisrt      last  first
0  DavidCampbell@gmail.com  David Campbell   David  Campbell    NaN
1       SamSmith@gmail.com       Sam Smith     Sam     Smith    NaN
2  JustinJozokas@gmail.com  Justin Jozokas  Justin   Jozokas    NaN
3       IronMan@avange.com             NaN     NaN     Stark   Tony
4           Cap@avange.com             NaN     NaN    Rogers  Steve

In [50]:
df.drop(index=4 , inplace = True)

In [51]:
df

                     email       full_name   fisrt      last first
0  DavidCampbell@gmail.com  David Campbell   David  Campbell   NaN
1       SamSmith@gmail.com       Sam Smith     Sam     Smith   NaN
2  JustinJozokas@gmail.com  Justin Jozokas  Justin   Jozokas   NaN
3       IronMan@avange.com             NaN     NaN     Stark  Tony

In [57]:
filt = (df['last']=='Campbell') | (df['last']=='Jozokas')

In [58]:
df[filt].index

Int64Index([0, 2], dtype='int64')

In [61]:
df.drop(df[filt].index , inplace=True)

In [62]:
df

                email  full_name fisrt   last first
1  SamSmith@gmail.com  Sam Smith   Sam  Smith   NaN
3  IronMan@avange.com        NaN   NaN  Stark  Tony